websocket-server/load-test.yml
config:
  target: "http://localhost:3001"
  phases:
    - duration: 30
      arrivalRate: 5
      name: "Warm up"
    - duration: 60
      arrivalRate: 10
      name: "Ramp up load"
    - duration: 30
      arrivalRate: 15
      name: "Sustained load"
scenarios:
  - name: "Health check"
    weight: 20
    flow:
      - get:
          url: "/health"
  - name: "Stats check"
    weight: 20
    flow:
      - get:
          url: "/stats"
  - name: "Broadcast message"
    weight: 60
    flow:
      - post:
          url: "/broadcast"
          headers:
            Content-Type: "application/json"
          json:
            type: "TASK_UPDATE"
            projectId: "load-test-project-{{ $randomString() }}"
            payload:
              id: "task-{{ $randomString() }}"
              title: "Load test task {{ $randomString() }}"
              changes:
                title: "Updated task {{ $randomString() }}"
            operationId: "op-{{ $randomString() }}"
            timestamp: "{{ $timestamp }}"